static关键字：
	static是一个修饰符，用于修饰成员（成员变量和成员函数）。
	
	具有以下特点：
		1、随着类的加载而加载，随着类的消失而消失，生命周期最长。
		2、优先于对象存在---静态先存在，对象后存在。
		3、被所有对象所共享。
		4、可以直接被类名调用。即：类名.静态成员。
	
	使用注意：
		静态方法只能访问静态成员
		静态方法中不可以写this，super关键字--因为静态优先于对象存在。
	
	实例变量和类变量的区别：
		类变量随着类的加载而存在于方法区中。
		实例变量随着对象的加载存在于堆内存中。
	
	静态的利弊：
		利：对对象的共享数据进行单独空间的存储，节省空间；可以直接被类名调用。
		弊：生命周期过长；访问出现局限性（静态只能访问静态）。
	
	什么时候定义静态变量呢？当对象中出现共享数据时，该数据被静态缩修饰。
	什么时候定义静态函数呢？当功能内部没有访问到非静态数据（对象的特有数据）时，那么该功能可以定义成静态的。
	
	静态代码块：
		特点：随着类的加载而执行，只执行一次，并优先于主函数 。用于给类进行初始化的。