什么情况下适合用UDP协议，什么情况下适合用TCP协议？
 * 
 * 答案:TCP提供的是面向连接的、可靠的数据流传输，可避免数据传输错误,
 * 			面向连接的协议在任何数据传输前就建立好了点到点的连接。
 *	        而UDP提供的是非面向连接的、不可靠的数据流传输。当一个UDP数据包在网络中移动时，发送过程并不知道它是否到达了目的地，
 *			除非应用层已经确认了它已到达的事实。
 *
 *		所以：
 *		TCP：1.建立连接，形成传输数据的通道。
 *	         2.在连接中进行大数据传输。
 *	         3.通过三次握手完成连接，是可靠协议。
 *	         4.因为必须建立连接，所以效率会稍低。
 *			主要用于数据下载，文件传输，可靠性要求高的应用
 *		UDP：1.将数据及源和目的封装成数据包中，不需要建立连接。
 *          2.每个数据报包的大小在限制在64k内。
 *          3.因无连接，是不可靠的协议。
 *          4.不需要建立连接，速度快。
 *			不管连上连不上它都发送数据，所以数据也就有可能收不到，不可靠。主要用于视频会议聊天什么的，一些缺少点数据无关紧要，
 *			可靠性要求低，传输经济的应用。