黑马程序员训练营入学考试题
1、 编写一个类，在main方法中定义一个Map对象（采用泛型），加入若干个对象，然后遍历并打印出各元素的key和value。
2、 写一个方法，此方法可将obj对象中名为propertyName的属性的值设置为value.   
public void setProperty(Object obj, String propertyName, Object value){   
}
3、 有五个学生，每个学生有3门课（语文、数学、英语）的成绩，写一个程序接收从键盘输入学生的信息，输入格式为：name,30,30,30（姓名，三门课成绩），然后把输入的学生信息按总分从高到低的顺序写入到一个名称"stu.txt"文件中。要求：stu.txt文件的格式要比较直观，打开这个文件，就可以很清楚的看到学生的信息。
4、 请说明Java中字符'\'的含义，有什么作用？
5、 编写一个程序，获取10个1至20的随机数，要求随机数不能重复。
6、 有一个类为ClassA,有一个类为ClassB，在ClassB中有一个方法b，此方法抛出异常，在ClassA类中有一个方法a，请在这个方法中调用b,然后抛出异常。在客户端有一个类为TestC,有一个方法为c ,请在这个方法中捕捉异常的信息。完成这个例子，请说出java中针对异常的处理机制。
7、 编写一个类，增加一个实例方法用于打印一条字符串。并使用反射手段创建该类的对象， 并调用该对象中的方法。
8、 编写程序，生成5个1至10之间的随机整数，存入一个List集合，编写方法对List集合进行排序（自定义排序算法，禁用Collections.sort方法和TreeSet），然后遍历集合输出。
9、 写一方法，打印等长的二维数组，要求从1开始的自然数由方阵的最外圈向内螺旋方式地顺序排列。 如： n = 4 则打印：                            
10、 有100个人围成一个圈，从1开始报数，报到14的这个人就要退出。然后其他人重新开始，从1报数，到14退出。问：最后剩下的是100人中的第几个人？

-----------------------------------------------------------------
基础测试。
2：求斐波那契数列第n项，n<30，斐波那契数列前10项为 1,1,2,3,5,8,13,21,34,55
3请列举您了解的一些排序算法，并用Java语言实现一个效率较高的。
 * 答案：插入排序、冒泡排序、希尔排序、快速排序、堆排序、归并排序、基数排序、选择排序、桶排序、基数排序等。
  下面是归并排序的java语言实现。
5编写一个可以获取文件扩展名的函数，形参接收一个文件名字符串，返回一个扩展名字符串。
6用控制台程序倒着输出九九乘法表；输出结果按下图所示：
7编写程序，打印1到100之内的整数，但数字中包含7的要跳过，例如：17、27、71、72
8数组去重复，例如: 原始数组是{4,2,4,6,1,2,4,7,8}，得到结果{4,2,6,1,7,8}
9编写程序，将指定目录下所有.java文件拷贝到另一个目的中，并将扩展名改为.txt
10 声明类Student，包含3个成员变量：name、age、score，创建5个对象装入TreeSet，按照成绩排序输出结果（考虑成绩相同的问题）。